export type HomeItem = {
  label: string;
  href?: string;
  linkLabel?: string;
  external?: boolean;
  prefix?: string;
};

export type HomeSection = {
  title: string;
  items?: HomeItem[];
  volumes?: {
    include?: number[];
    exclude?: number[];
    sort?: "asc" | "desc";
    showEmpty?: boolean;
  };
};

export type SiteConfig = {
  name: string;
  description: string;
  homeAsciiArt: string;
  homeSections: HomeSection[];
};

export const siteConfig: SiteConfig = {
  name: "Entropic",
  description: "Security Research Philes",
  homeAsciiArt: `
▓█████▄ ▓█████ ▄▄▄      ▓█████▄  ▄▄▄▄   ▓█████ ▄▄▄     ▄▄▄█████▓   ▒███████▒▓█████  ██▓███   ██░ ██▓██   ██▓ ██▀███  
▒██▀ ██▌▓█   ▀▒████▄    ▒██▀ ██▌▓█████▄ ▓█   ▀▒████▄   ▓  ██▒ ▓▒   ▒ ▒ ▒ ▄▀░▓█   ▀ ▓██░  ██▒▓██░ ██▒▒██  ██▒▓██ ▒ ██▒
░██   █▌▒███  ▒██  ▀█▄  ░██   █▌▒██▒ ▄██▒███  ▒██  ▀█▄ ▒ ▓██░ ▒░   ░ ▒ ▄▀▒░ ▒███   ▓██░ ██▓▒▒██▀▀██░ ▒██ ██░▓██ ░▄█ ▒
░▓█▄   ▌▒▓█  ▄░██▄▄▄▄██ ░▓█▄   ▌▒██░█▀  ▒▓█  ▄░██▄▄▄▄██░ ▓██▓ ░      ▄▀▒   ░▒▓█  ▄ ▒██▄█▓▒ ▒░▓█ ░██  ░ ▐██▓░▒██▀▀█▄  
░▒████▓ ░▒████▒▓█   ▓██▒░▒████▓ ░▓█  ▀█▓░▒████▒▓█   ▓██▒ ▒██▒ ░    ▒███████▒░▒████▒▒██▒ ░  ░░▓█▒░██▓ ░ ██▒▓░░██▓ ▒██▒
 ▒▒▓  ▒ ░░ ▒░ ░▒▒   ▓▒█░ ▒▒▓  ▒ ░▒▓███▀▒░░ ▒░ ░▒▒   ▓▒█░ ▒ ░░      ░▒▒ ▓░▒░▒░░ ▒░ ░▒▓▒░ ░  ░ ▒ ░░▒░▒  ██▒▒▒ ░ ▒▓ ░▒▓░
 ░ ▒  ▒  ░ ░  ░ ▒   ▒▒ ░ ░ ▒  ▒ ▒░▒   ░  ░ ░  ░ ▒   ▒▒ ░   ░       ░░▒ ▒ ░ ▒ ░ ░  ░░▒ ░      ▒ ░▒░ ░▓██ ░▒░   ░▒ ░ ▒░
 ░ ░  ░    ░    ░   ▒    ░ ░  ░  ░    ░    ░    ░   ▒    ░         ░ ░ ░ ░ ░   ░   ░░        ░  ░░ ░▒ ▒ ░░    ░░   ░ 
   ░       ░  ░     ░  ░   ░     ░         ░  ░     ░  ░             ░ ░       ░  ░          ░  ░  ░░ ░        ░     
 ░                       ░            ░                            ░                                ░ ░              
`,

  homeSections: [
    {
      title: "TL;DR",
      items: [
        {
          label: "Cybersecurity enthusiast. Idealist. Purist."
        },
        {
          label: "Researcher @0x5900FX",
          linkLabel: "@0x5900FX",
          href: "https://github.com/0x5900FX",
          external: true
        }
      ]
    },
    {
      title: "Philes",
      volumes: {
        sort: "asc",
        showEmpty: false
      }
    },
    {
      title: "Research",
      items: [
        { label: "Binary Exploitation" },
        { label: "Windows Security" },
        { label: "IoT Security" },
        { label: "Automation" }
      ]
    },
    {
      title: "Contact",
      items: [
        { label: "root -at- cubeyond -dot- net" },
        {
          label: "PGP Encryption Key",
          href: ""
        },
        {
          label: "github@plt",
          href: "https://github.com/0x5900FX/",
          external: true,
          prefix: "~ call"
        },
        {
          label: "memos@plt",
          href: "",
          external: true,
          prefix: "~ call"
        },
        {
          label: "kofi@plt",
          href: "",
          external: true,
          prefix: "~ call"
        }
      ]
    }
  ]
};
